app/views/results/_answer_fields.erb

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  	question_id = f.object.attributes["question_id"]
  	question = Question.find(question_id)