app/views/results/show.html.erb

SELECT "options".* FROM "options" INNER JOIN "answers_options" ON "options"."id" = "answers_options"."option_id" WHERE "answers_options"."answer_id" = $1  [["answer_id", 9]]
---
						<%else%>
							<%answer.options.each do |option|%>