app/views/surveys/show.html.erb

	<ol>
		<% @survey.questions.each  do |question|%>
---
SELECT "questions".* FROM "questions"  WHERE "questions"."survey_id" IN (1)

			 	<ul type="square">
			 		<% question.options.each do |option|%>
---
SELECT "options".* FROM "options"  WHERE "options"."question_id" IN (1, 2, 3)