app/controllers/results_controller.rb

  def index
       @results = Result.all
---
SELECT "results".* FROM "results"

  def show
    @survey = Survey.find(@result.survey_id)
---
SELECT  "surveys".* FROM "surveys"  WHERE "surveys"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    if params["type"] == "SurveyResult"
      @result = Result::SurveyResult.new
      @survey = Survey.find(params[:survey_id])
      @survey.questions.each do |question|
---
SELECT  "surveys".* FROM "surveys"  WHERE "surveys"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "questions".* FROM "questions"  WHERE "questions"."survey_id" = $1  [["survey_id", 1]]

  def create
    @result = Result.new(result_params)

    respond_to do |format|
      if @result.save
---
INSERT INTO "results" ("comment", "created_at", "ended_date", "started_date", "survey_id", "task_id", "type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @result.destroy
---
DELETE FROM "results" WHERE "results"."type" IN ('SurveyResult') AND "results"."id" = $1  [["id", 1]]

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results"  WHERE "results"."id" = $1 LIMIT 1  [["id", 2]]