app/controllers/surveys_controller.rb

  def create
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save
---
INSERT INTO "surveys" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-02-12 05:15:21.849132"], ["description", "dawdada"], ["name", "prueba"], ["updated_at", "2015-02-12 05:15:21.849132"]]

  def update
    respond_to do |format|
      if @survey.update(survey_params)
---
UPDATE "surveys" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "surveys"."id" = 3  [["description", "adawdwadaw"], ["name", "encuesta 4"], ["updated_at", "2015-02-13 17:35:25.276882"]]

    def set_survey
      @survey = Survey.includes(questions: :options).find(params[:id])
---
SELECT  "surveys".* FROM "surveys"  WHERE "surveys"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "options".* FROM "options"  WHERE "options"."question_id" IN (1, 2, 3)