app/controllers/tasks_controller.rb

  def my_tasks
    user_id = params[:id]
    @tasks = Task.where('tasks.user_id = ? AND
                         max > (select count(*) from results where results.task_id = tasks.id) AND
                         tasks.expired_on >= ?',user_id, Date.today)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = 1 AND ("tasks"."id" NOT IN (SELECT "results"."task_id" FROM "results"  WHERE "results"."user_id" = 1))

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "expired_on", "latitude", "longitude", "max", "min", "name", "started_on", "targeted_to", "type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "description" = $1, "type" = $2, "updated_at" = $3 WHERE "tasks"."id" = 1  [["description", "awdawda"], ["type", "SurveyTask"], ["updated_at", "2015-05-05 16:38:13.632473"]]