app/controllers/users_controller.rb

INSERT INTO "users" ("avatar", "created_at", "email", "name", "password", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["avatar", "avatar"], ["created_at", "2015-03-03 15:38:40.936251"], ["email", "tutemon@gmail.com"], ["name", "Admin"], ["password", "1234"], ["updated_at", "2015-03-03 15:38:40.936251"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save